app/controllers/emotions_controller.rb

  def create
    @emotion = Emotion.new
    @emotion.name = params[:emotion][:name]
    @emotion.save!
---
INSERT INTO "emotions" ("name", "created_at", "updated_at", "id") VALUES('Love', '2012-03-11 04:31:06', '2012-03-11 04:31:06', 'a1c9d23c-9987-414a-bb4b-ca417768b043')