app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('WEvBRcWDZlAUAsVLDxv8', '2012-04-01 03:37:41', '2012-04-01 03:37:41', '4f308f28598ce588a2f526a70cbd39446c41e61e4bc8f0c3c5ab4ba26becde329f2799b9acd69eaab7a98dca90f6664e22af819e8e239522cd0aa87d6e50fd39', 'cEsja7sXzsuPJYCyath', '2012-04-01 03:37:41', 0, 'rFlh9VMPqp668E51cqP2', '2012-04-01 03:37:41', '7429751cbc78d71f5717508456a78e4e16bfa0d25c5b7819f42fa91683884662a0be576aa4ad5581b363b97fcfd09d5fa33f8753043748d1fb771f1830d992cc', 1, NULL, NULL, 'inder@wastedcode.com')

  def update
    @user = @current_user
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "login_count" = 3, "persistence_token" = 'd6fdc69ba225d0bf5435fba088e29c091f08d64fce9263acd0098bca546d3e0e622c801cc8d7e1f539a7fd9dba13d14c0eb55e6f6aaf581174ad6ac0073a0aac', "updated_at" = '2012-04-01 03:52:47', "perishable_token" = 'Oo60aqqOeGJ4QtIctoY0', "last_request_at" = '2012-04-01 03:52:47', "last_login_at" = '2012-04-01 03:51:38', "current_login_at" = '2012-04-01 03:52:47', "password_salt" = 'x0BhalLbfMHXWwgnoDGo', "crypted_password" = 'bd2adcdd613fe1b54560223c0d4d1a36910706707bc1ab9ae3fadc0f26607a4d2af5b4a98ebbd0ef1c049988fa8494cef98a7ad1f40b2eafd587f37a8c8690eb' WHERE "id" = 1